GrumpyOldPizza/ArduinoCore-stm32l0/libraries/LoRaWAN/src/LoRaWAN.cpp
/*
 * Copyright (c) 2017-2018 Thomas Roell.  All rights reserved.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to
 * deal with the Software without restriction, including without limitation the
 * rights to use, copy, modify, merge, publish, distribute, sublicense, and/or
 * sell copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 *  1. Redistributions of source code must retain the above copyright notice,
 *     this list of conditions and the following disclaimers.
 *  2. Redistributions in binary form must reproduce the above copyright
 *     notice, this list of conditions and the following disclaimers in the
 *     documentation and/or other materials provided with the distribution.
 *  3. Neither the name of Thomas Roell, nor the names of its contributors
 *     may be used to endorse or promote products derived from this Software
 *     without specific prior written permission.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.  IN NO EVENT SHALL THE
 * CONTRIBUTORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING
 * FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS
 * WITH THE SOFTWARE.
 */

#include "Arduino.h"
#include "LoRaWAN.h"
#include "STM32L0.h"
#include "wiring_private.h"

extern "C" {
#include "LoRaMac.h"
#include "LoRaMacTest.h"
}

#define REGION_AS923 0
#define REGION_AU915 1
#define REGION_CN470 2
#define REGION_CN779 3
#define REGION_EU433 4
#define REGION_EU868 5
#define REGION_IN865 6
#define REGION_KR920 7
#define REGION_US915 8

struct LoRaWANBand {
    uint8_t id;
    uint8_t xlateTxPower[11];
    const LoRaMacRegion_t *region;
};

const struct LoRaWANBand AS923 = {
    REGION_AS923,
    { 16, 14, 12, 10,  8,  6,  4,  2,  0,  0,  0 },
    &LoRaMacRegionAS923,
};

const struct LoRaWANBand AU915 = {
    REGION_AU915,
    { 30, 28, 26, 24, 22, 20, 18, 16, 14, 12, 10 },
    &LoRaMacRegionAU915,
};

const struct LoRaWANBand EU868 = {
    REGION_EU868,
    { 16, 14, 12, 10,  8,  6,  4,  2,  0,  0,  0 },
    &LoRaMacRegionEU868,
};

const struct LoRaWANBand IN865 = {
    REGION_IN865,
    { 30, 28, 26, 24, 22, 20, 18, 16, 14, 12, 10 },
    &LoRaMacRegionIN865,
};

const struct LoRaWANBand KR920 = {
    REGION_KR920,
    { 14, 12, 10,  8,  6,  4,  2,  0,  0,  0,  0 },
    &LoRaMacRegionKR920,
};

const struct LoRaWANBand US915 = {
    REGION_US915,
    { 30, 28, 26, 24, 22, 20, 18, 16, 14, 12, 10 },
    &LoRaMacRegionUS915,
};


static void BoardGetUniqueId(uint8_t *DevEui)
{
    uint32_t UID[3];

    stm32l0_system_uid(&UID[0]);

    UID[0] = UID[0] + UID[2];
    
    DevEui[0] = UID[1] >> 0;
    DevEui[1] = UID[1] >> 8;
    DevEui[2] = UID[1] >> 16;
    DevEui[3] = UID[1] >> 24;
    DevEui[4] = UID[0] >> 0;
    DevEui[5] = UID[0] >> 8;
    DevEui[6] = UID[0] >> 16;
    DevEui[7] = UID[0] >> 24;
}

static uint32_t ConvertString(uint8_t *out, uint32_t size, const char *cp)
{
    uint8_t c0, c1;
    uint8_t *out_e;

    if (strlen(cp) != (size * 2)) {
        return 0;
    }

    out_e = out + size;

    do
    {
        c0 = *cp++;

        if      ((c0 >= '0') && (c0 <= '9')) { c0 = c0 - '0';      }
        else if ((c0 >= 'A') && (c0 <= 'F')) { c0 = c0 - 'A' + 10; }
        else if ((c0 >= 'a') && (c0 <= 'f')) { c0 = c0 - 'a' + 10; }
        else
        {
            return 0;
        }

        c1 = *cp++;

        if      ((c1 >= '0') && (c1 <= '9')) { c1 = c1 - '0';      }
        else if ((c1 >= 'A') && (c1 <= 'F')) { c1 = c1 - 'A' + 10; }
        else if ((c1 >= 'a') && (c1 <= 'f')) { c1 = c1 - 'a' + 10; }
        else
        {
            return 0;
        }

        *out++ = (c0 << 4) | c1;
    }
    while (out != out_e);

    return size;
}

static LoRaMacStatus_t LoRaWANQueryTxPossible( uint8_t size, LoRaMacTxInfo_t* txInfo )
{
    IRQn_Type irq;

    irq = (IRQn_Type)((__get_IPSR() & 0x1ff) - 16);

    if (irq == Reset_IRQn)
    {
        return (LoRaMacStatus_t)armv6m_svcall_2((uint32_t)&LoRaMacQueryTxPossible, (uint32_t)size, (uint32_t)txInfo);
    }
    else
    {
        if ((irq == SVC_IRQn) || (irq == PendSV_IRQn))
        {
            return LoRaMacQueryTxPossible(size, txInfo);
        }
        else
        {
            return LORAMAC_STATUS_BUSY;
        }
    }
}

static LoRaMacStatus_t LoRaWANChannelAdd( uint8_t id, ChannelParams_t *params )
{
    IRQn_Type irq;

    irq = (IRQn_Type)((__get_IPSR() & 0x1ff) - 16);

    if (irq == Reset_IRQn)
    {
        return (LoRaMacStatus_t)armv6m_svcall_2((uint32_t)&LoRaMacChannelAdd, (uint32_t)id, (uint32_t)params);
    }
    else
    {
        if ((irq == SVC_IRQn) || (irq == PendSV_IRQn))
        {
            return LoRaMacChannelAdd(id, params);
        }
        else
        {
            return LORAMAC_STATUS_BUSY;
        }
    }
}

static LoRaMacStatus_t LoRaWANChannelRemove( uint8_t id )
{
    IRQn_Type irq;

    irq = (IRQn_Type)((__get_IPSR() & 0x1ff) - 16);

    if (irq == Reset_IRQn)
    {
        return (LoRaMacStatus_t)armv6m_svcall_1((uint32_t)&LoRaMacChannelRemove, (uint32_t)id);
    }
    else
    {
        if ((irq == SVC_IRQn) || (irq == PendSV_IRQn))
        {
            return LoRaMacChannelRemove(id);
        }
        else
        {
            return LORAMAC_STATUS_BUSY;
        }
    }
}

#ifdef notyet

static LoRaMacStatus_t LoRaWANMulticastChannelLink( MulticastParams_t *channelParam )
{
    IRQn_Type irq;

    irq = (IRQn_Type)((__get_IPSR() & 0x1ff) - 16);

    if (irq == Reset_IRQn)
    {
        return (LoRaMacStatus_t)armv6m_svcall_1((uint32_t)&LoRaMacMulticastChannelLink, (uint32_t)channelParam);
    }
    else
    {
        if ((irq == SVC_IRQn) || (irq == PendSV_IRQn))
        {
            return LoRaMacMulticastChannelLink(channelParam);
        }
        else
        {
            return LORAMAC_STATUS_BUSY;
        }
    }
}

