GrumpyOldPizza/ArduinoCore-stm32l0/libraries/LoRaWAN/src/LoRaWAN.cpp
static LoRaMacStatus_t LoRaWANMulticastChannelUnlink( MulticastParams_t *channelParam )
{
    IRQn_Type irq;

    irq = (IRQn_Type)((__get_IPSR() & 0x1ff) - 16);

    if (irq == Reset_IRQn)
    {
        return (LoRaMacStatus_t)armv6m_svcall_1((uint32_t)&LoRaMacMulticastChannelUnlink, (uint32_t)channelParam);
    }
    else
    {
        if ((irq == SVC_IRQn) || (irq == PendSV_IRQn))
        {
            return LoRaMacMulticastChannelUnlink(channelParam);
        }
        else
        {
            return LORAMAC_STATUS_BUSY;
        }
    }
}

#endif

static LoRaMacStatus_t LoRaWANMibGetRequestConfirm( MibRequestConfirm_t *mibGet )
{
    IRQn_Type irq;

    irq = (IRQn_Type)((__get_IPSR() & 0x1ff) - 16);

    if (irq == Reset_IRQn)
    {
        return (LoRaMacStatus_t)armv6m_svcall_1((uint32_t)&LoRaMacMibGetRequestConfirm, (uint32_t)mibGet);
    }
    else
    {
        if ((irq == SVC_IRQn) || (irq == PendSV_IRQn))
        {
            return LoRaMacMibGetRequestConfirm(mibGet);
        }
        else
        {
            return LORAMAC_STATUS_BUSY;
        }
    }
}

static LoRaMacStatus_t LoRaWANMibSetRequestConfirm( MibRequestConfirm_t *mibSet )
{
    IRQn_Type irq;

    irq = (IRQn_Type)((__get_IPSR() & 0x1ff) - 16);

    if (irq == Reset_IRQn)
    {
        return (LoRaMacStatus_t)armv6m_svcall_1((uint32_t)&LoRaMacMibSetRequestConfirm, (uint32_t)mibSet);
    }
    else
    {
        if ((irq == SVC_IRQn) || (irq == PendSV_IRQn))
        {
            return LoRaMacMibSetRequestConfirm(mibSet);
        }
        else
        {
            return LORAMAC_STATUS_BUSY;
        }
    }
}

static LoRaMacStatus_t LoRaWANMlmeRequest( MlmeReq_t *mlmeRequest )
{
    IRQn_Type irq;

    irq = (IRQn_Type)((__get_IPSR() & 0x1ff) - 16);

    if (irq == Reset_IRQn)
    {
        return (LoRaMacStatus_t)armv6m_svcall_1((uint32_t)&LoRaMacMlmeRequest, (uint32_t)mlmeRequest);
    }
    else
    {
        if ((irq == SVC_IRQn) || (irq == PendSV_IRQn))
        {
            return LoRaMacMlmeRequest(mlmeRequest);
        }
        else
        {
            return LORAMAC_STATUS_BUSY;
        }
    }
}

static LoRaMacStatus_t LoRaWANMcpsRequest( McpsReq_t *mcpsRequest )
{
    IRQn_Type irq;

    irq = (IRQn_Type)((__get_IPSR() & 0x1ff) - 16);

    if (irq == Reset_IRQn)
    {
        return (LoRaMacStatus_t)armv6m_svcall_1((uint32_t)&LoRaMacMcpsRequest, (uint32_t)mcpsRequest);
    }
    else
    {
        if ((irq == SVC_IRQn) || (irq == PendSV_IRQn))
        {
            return LoRaMacMcpsRequest(mcpsRequest);
        }
        else
        {
            return LORAMAC_STATUS_BUSY;
        }
    }
}

static uint8_t LoRaWANGetBatteryLevel()
{
    if (STM32L0.getVBUS()) {
        return BAT_LEVEL_EXT_SRC;
    }

#if defined(STM32L0_CONFIG_VBAT_EMPTY) && defined(STM32L0_CONFIG_VBAT_FULL)
    float vbat = STM32L0.getVBAT();

    if (vbat < STM32L0_CONFIG_VBAT_EMPTY) {
        return BAT_LEVEL_EMPTY;
    }

    if (vbat > STM32L0_CONFIG_VBAT_FULL) {
        return BAT_LEVEL_FULL;
    }

    return (uint8_t)(((vbat - STM32L0_CONFIG_VBAT_EMPTY) / (STM32L0_CONFIG_VBAT_FULL - STM32L0_CONFIG_VBAT_EMPTY)) * (BAT_LEVEL_FULL - BAT_LEVEL_EMPTY) + BAT_LEVEL_EMPTY);

#else /*  defined(STM32L0_CONFIG_VBAT_EMPTY) && defined(STM32L0_CONFIG_VBAT_FULL) */

    return BAT_LEVEL_NO_MEASURE;

#endif /*  defined(STM32L0_CONFIG_VBAT_EMPTY) && defined(STM32L0_CONFIG_VBAT_FULL) */
}

LoRaWANClass::LoRaWANClass()
{
    _Band = NULL;

    _tx_port = 1;
    _tx_active = false;
    _tx_ack = 0;
    _tx_busy = false;

    _rx_index = 0;
    _rx_size = 0;
    _rx_margin = 255;
    _rx_gateways = 0;
    _rx_ack = 0;

    _Retries = 8;
    _Repeat = 1;

    _PublicNetwork = true;
    _AdrEnable = true;
    _DataRate = 0;
    _TxPower = 0;

    _session.Joined = LORAWAN_JOINED_NONE;
}

int LoRaWANClass::begin(const struct LoRaWANBand &band)
{
    MibRequestConfirm_t mibReq;

    static const LoRaMacPrimitives_t LoRaWANPrimitives = {
        LoRaWANClass::__McpsConfirm,
        LoRaWANClass::__McpsIndication,
        LoRaWANClass::__MlmeConfirm,
        LoRaWANClass::__MlmeIndication,
    };

    static const LoRaMacCallback_t LoRaWANCallbacks = {
        LoRaWANGetBatteryLevel,
    };

    if (__get_IPSR() != 0) {
        return 0;
    }

    _Band = &band;

    LoRaMacInitialization(&LoRaWANPrimitives, &LoRaWANCallbacks, _Band->region);

    mibReq.Type = MIB_PUBLIC_NETWORK;
    mibReq.Param.EnablePublicNetwork = _PublicNetwork;
    LoRaMacMibSetRequestConfirm(&mibReq);

    mibReq.Type = MIB_ADR;
    mibReq.Param.AdrEnable = _AdrEnable;
    LoRaMacMibSetRequestConfirm(&mibReq);

    mibReq.Type = MIB_CHANNELS_DEFAULT_DATARATE;
    mibReq.Param.ChannelsDefaultDatarate = _DataRate;
    LoRaMacMibSetRequestConfirm(&mibReq);

    mibReq.Type = MIB_CHANNELS_DATARATE;
    mibReq.Param.ChannelsDatarate = _DataRate;
    LoRaMacMibSetRequestConfirm(&mibReq);

    mibReq.Type = MIB_CHANNELS_DEFAULT_TX_POWER;
    mibReq.Param.ChannelsDefaultTxPower = _TxPower;
    LoRaMacMibSetRequestConfirm(&mibReq);

    mibReq.Type = MIB_CHANNELS_TX_POWER;
    mibReq.Param.ChannelsTxPower = _TxPower;
    LoRaMacMibSetRequestConfirm(&mibReq);

    return 1;
}

void LoRaWANClass::stop()
{
    MibRequestConfirm_t mibReq;

    if (__get_IPSR() != 0) {
        return;
    }

    _session.Joined = LORAWAN_JOINED_NONE;

    mibReq.Type = MIB_NETWORK_JOINED;
    mibReq.Param.IsNetworkJoined = true;
    LoRaWANMibSetRequestConfirm(&mibReq);
}

int LoRaWANClass::joinOTAA(const char *appEui, const char *appKey, const char *devEui)
{
    MlmeReq_t mlmeReq;

    if (!_Band) {
        return 0;
    }

    if (devEui == NULL)
    {
        BoardGetUniqueId(_session.DevEui);
    }
    else
    {
        if (!ConvertString(_session.DevEui, 8, devEui)) {
            return 0;
        }
    }

    if (!ConvertString(_session.AppEui, 8, appEui)) {
        return 0;
    }

    if (!ConvertString(_session.AppKey, 16, appKey)) {
        return 0;
    }

    mlmeReq.Type = MLME_JOIN;
    mlmeReq.Req.Join.DevEui = _session.DevEui;
    mlmeReq.Req.Join.AppEui = _session.AppEui;
    mlmeReq.Req.Join.AppKey = _session.AppKey;
    mlmeReq.Req.Join.Datarate = _DataRate;

