GrumpyOldPizza/ArduinoCore-stm32l0/libraries/LoRaWAN/src/LoRaWAN.cpp
    if (LoRaWANMlmeRequest(&mlmeReq) != LORAMAC_STATUS_OK) {
        return 0;
    }

    _session.Joined = LORAWAN_JOINED_NONE;
    _session.DataRate = _DataRate;
    _session.TxPower = _TxPower;
    _session.UpLinkCounter = 0;
    _session.DownLinkCounter = 0;

    _tx_busy = true;

    return 1;
}

int LoRaWANClass::joinABP(const char *devAddr, const char *nwkSKey, const char *appSKey)
{
    MibRequestConfirm_t mibReq;
    
    if (!_Band) {
        return 0;
    }

    if (!ConvertString((uint8_t*)&_session.DevAddr, 4, devAddr)) {
        return 0;
    }

    if (!ConvertString(_session.NwkSKey, 16, nwkSKey)) {
        return 0;
    }

    if (!ConvertString(_session.AppSKey, 16, appSKey)) {
        return 0;
    }

    _session.Joined = LORAWAN_JOINED_ABP;
    _session.DataRate = _DataRate;
    _session.TxPower = _TxPower;
    _session.UpLinkCounter = 0;
    _session.DownLinkCounter = 0;

    memset(_session.DevEui, 0, 8);
    memset(_session.AppEui, 0, 8);
    memset(_session.AppKey, 0, 16);

    mibReq.Type = MIB_UPLINK_COUNTER;
    mibReq.Param.UpLinkCounter = _session.UpLinkCounter;
    LoRaWANMibSetRequestConfirm(&mibReq);

    mibReq.Type = MIB_DOWNLINK_COUNTER;
    mibReq.Param.DownLinkCounter = _session.DownLinkCounter;
    LoRaWANMibSetRequestConfirm(&mibReq);

    mibReq.Type = MIB_NET_ID;
    mibReq.Param.NetID = 0;
    LoRaWANMibSetRequestConfirm(&mibReq);

    mibReq.Type = MIB_DEV_ADDR;
    mibReq.Param.DevAddr = _session.DevAddr;
    LoRaWANMibSetRequestConfirm(&mibReq);

    mibReq.Type = MIB_NWK_SKEY;
    mibReq.Param.NwkSKey = _session.NwkSKey;
    LoRaWANMibSetRequestConfirm(&mibReq);

    mibReq.Type = MIB_APP_SKEY;
    mibReq.Param.AppSKey = _session.AppSKey;
    LoRaWANMibSetRequestConfirm(&mibReq);

    mibReq.Type = MIB_NETWORK_JOINED;
    mibReq.Param.IsNetworkJoined = true;
    LoRaWANMibSetRequestConfirm(&mibReq);

    _tx_ack = 1;
    _tx_busy = false;

    return 1;
}

bool LoRaWANClass::joined()
{
    return (_session.Joined != LORAWAN_JOINED_NONE);
}

bool LoRaWANClass::confirmed()
{
    return _tx_ack;
}

bool LoRaWANClass::checked()
{
    return _rx_ack;
}

bool LoRaWANClass::busy()
{
    return _tx_busy;
}

int LoRaWANClass::beginPacket(uint8_t port)
{
    if (_session.Joined == LORAWAN_JOINED_NONE) {
        return 0;
    }

    if (_tx_busy) {
        return 0;
    }

    if ((port < 1) || (port > 223)) {
        return 0;
    }

    _tx_size = 0;
    _tx_port = port;
    _tx_active = true;

    return 1;
}

int LoRaWANClass::endPacket(bool confirm)
{
    IRQn_Type irq;
    McpsReq_t mcpsReq;
    LoRaMacTxInfo_t txInfo;

    irq = (IRQn_Type)((__get_IPSR() & 0x1ff) - 16);

    if (irq >= SysTick_IRQn) {  
      return 0;
    }

    if (!_tx_active) {
        return 0;
    }

    _tx_confirm = confirm;
    _tx_ack = false;
    _tx_busy = true;

    if (_tx_size == 0)
    {
        _tx_active = false;

        // Send empty frame in order to flush MAC commands
        mcpsReq.Type = MCPS_UNCONFIRMED;
        mcpsReq.Req.Unconfirmed.fBuffer = NULL;
        mcpsReq.Req.Unconfirmed.fBufferSize = 0;
        mcpsReq.Req.Unconfirmed.Datarate = _DataRate;

        if (LoRaWANMcpsRequest(&mcpsReq) != LORAMAC_STATUS_OK)
        {
            _tx_busy = false;

            return 0;
        }
    }
    else
    {
        if (LoRaWANQueryTxPossible(_tx_size, &txInfo) != LORAMAC_STATUS_OK)
        {
            if (_tx_size > txInfo.CurrentPayloadSize)
            {
                // Payload will never fit ...
                _tx_active = false;
                _tx_busy = false;
            }
            else
            {
                // Send empty frame in order to flush MAC commands
                mcpsReq.Type = MCPS_UNCONFIRMED;
                mcpsReq.Req.Unconfirmed.fBuffer = NULL;
                mcpsReq.Req.Unconfirmed.fBufferSize = 0;
                mcpsReq.Req.Unconfirmed.Datarate = _DataRate;
                
                if (LoRaWANMcpsRequest(&mcpsReq) != LORAMAC_STATUS_OK)
                {
                    _tx_active = false;
                    _tx_busy = false;
                }
            }

            return 0;
        }
        else
        {
            _tx_active = false;

            if (_tx_confirm)
            {
                mcpsReq.Type = MCPS_CONFIRMED;
                mcpsReq.Req.Confirmed.fPort = _tx_port;
                mcpsReq.Req.Confirmed.fBuffer = &_tx_data[0];
                mcpsReq.Req.Confirmed.fBufferSize = _tx_size;
                mcpsReq.Req.Confirmed.NbTrials = 1 + _Retries;
                mcpsReq.Req.Confirmed.Datarate = _DataRate;
            }
            else
            {
                mcpsReq.Type = MCPS_UNCONFIRMED;
                mcpsReq.Req.Unconfirmed.fPort = _tx_port;
                mcpsReq.Req.Unconfirmed.fBuffer = &_tx_data[0];
                mcpsReq.Req.Unconfirmed.fBufferSize = _tx_size;
                mcpsReq.Req.Unconfirmed.Datarate = _DataRate;
            }

            if (LoRaWANMcpsRequest(&mcpsReq) != LORAMAC_STATUS_OK)
            {
                _tx_busy = false;
            
                return 0;
            }
        }
    }

    return 1;
}

int LoRaWANClass::sendPacket(const uint8_t *buffer, size_t size, bool confirm)
{
    return sendPacket(LORAWAN_DEFAULT_PORT, buffer, size, confirm);
}

int LoRaWANClass::sendPacket(uint8_t port, const uint8_t *buffer, size_t size, bool confirm)
{
    if (_session.Joined == LORAWAN_JOINED_NONE) {
        return 0;
    }

    if (_tx_busy) {
        return 0;
    }

    if (_tx_active) {
        return 0;
    }

    if ((port < 1) || (port > 223)) {
        return 0;
    }

    if (size > LORAWAN_MAX_PAYLOAD_SIZE) {
        return 0;
    }

    _tx_port = port;
    _tx_size = size;

    memcpy(&_tx_data[0], buffer, size);

    _tx_active = true;

    return endPacket(confirm);
}

int LoRaWANClass::availableForWrite()
{
    if (!_tx_active) {
        return 0;
    }

    return LORAWAN_MAX_PAYLOAD_SIZE - _tx_size;
}

size_t LoRaWANClass::write(uint8_t data)
{
    if (!_tx_active) {
        return 0;
    }

    if (_tx_size >= LORAWAN_MAX_PAYLOAD_SIZE) {
        return 0;
    }

    _tx_data[_tx_size++] = data;

    return 1;
}

size_t LoRaWANClass::write(const uint8_t *data, size_t size)
{
    if (!_tx_active) {
        return 0;
    }

    if (size > (unsigned int)(LORAWAN_MAX_PAYLOAD_SIZE - _tx_size)) {
        size = LORAWAN_MAX_PAYLOAD_SIZE - _tx_size;
    }

    memcpy(&_tx_data[_tx_size], data, size);

    _tx_size += size;

    return size;
}

int LoRaWANClass::parsePacket()
{
    uint32_t rx_read;

    if (_rx_size) {
        _rx_index = _rx_next;
        _rx_read = _rx_next;
        _rx_size = 0;
        _rx_port = 0;
        _rx_multicast = 0;
    }

