GrumpyOldPizza/ArduinoCore-stm32l0/libraries/LoRaWAN/src/LoRaWAN.cpp
    rx_read = _rx_read;

    if (rx_read == _rx_write) {
        return 0;
    }

    _rx_size = _rx_data[rx_read];

    if (++rx_read == LORAWAN_RX_BUFFER_SIZE) {
        rx_read = 0;
    }

    _rx_port = _rx_data[rx_read];

    if (++rx_read == LORAWAN_RX_BUFFER_SIZE) {
        rx_read = 0;
    }

    _rx_multicast = _rx_data[rx_read];

    if (++rx_read == LORAWAN_RX_BUFFER_SIZE) {
        rx_read = 0;
    }

    _rx_index = rx_read;

    rx_read += _rx_size;

    if (rx_read >= LORAWAN_RX_BUFFER_SIZE) {
        rx_read -= LORAWAN_RX_BUFFER_SIZE;
    }

    _rx_next = rx_read;

    return _rx_size;
}

int LoRaWANClass::available()
{
    if (_rx_next >= _rx_index) {
        return (_rx_next - _rx_index);
    } else {
        return (_rx_next + (LORAWAN_RX_BUFFER_SIZE - _rx_index));
    }
}

int LoRaWANClass::read()
{
    int data;
    
    if (_rx_index == _rx_next) {
        return -1;
    }

    data = _rx_data[_rx_index++];

    if (_rx_index == LORAWAN_RX_BUFFER_SIZE) {
        _rx_index = 0;
    }

    return data;
}

size_t LoRaWANClass::read(uint8_t *buffer, size_t size)
{
    size_t count;

    if (_rx_index == _rx_next) {
        return 0;
    }

    if (_rx_next < _rx_index)
    {
        count = size;

        if (count > (size_t)(LORAWAN_RX_BUFFER_SIZE - _rx_index))
        {
            count = LORAWAN_RX_BUFFER_SIZE - _rx_index;
        }

        if (count)
        {
            memcpy(buffer, &_rx_data[_rx_index], count);
            
            buffer += count;
            size -= count;
            
            _rx_index += count;
            
            if (_rx_index == LORAWAN_RX_BUFFER_SIZE) {
                _rx_index = 0;
            }
        }
    }
    else
    {
        count = 0;
    }

    if (size)
    {
        if (size > (size_t)(_rx_next - _rx_index)) {
            size = _rx_next - _rx_index;
        }

        if (size)
        {
            memcpy(buffer, &_rx_data[_rx_index], size);
            
            buffer += size;
            count += size;
            
            _rx_index += size;
        }
    }

    return count;
}

int LoRaWANClass::peek(void)
{
    if (_rx_index == _rx_next) {
        return -1;
    }

    return _rx_data[_rx_index];
}

void LoRaWANClass::flush()
{
}

uint8_t LoRaWANClass::remotePort()
{
    return _rx_port;
}

int LoRaWANClass::lastRSSI()
{
    return _rx_rssi;
}

int LoRaWANClass::lastSNR()
{
    return _rx_snr;
}

void LoRaWANClass::linkCheck()
{
    MlmeReq_t mlmeReq;

    if (_session.Joined == LORAWAN_JOINED_NONE) {
        return;
    }

    _rx_ack = false;

    mlmeReq.Type = MLME_LINK_CHECK;
    LoRaWANMlmeRequest( &mlmeReq );
}

int LoRaWANClass::linkMargin()
{
    if (!_rx_ack) {
        return -1;
    }

    return _rx_margin;
}

int LoRaWANClass::linkGateways()
{
    if (!_rx_ack) {
        return -1;
    }

    return _rx_gateways;
}

void LoRaWANClass::onJoin(void(*callback)(void))
{
    _joinCallback = Callback(callback);
}

void LoRaWANClass::onJoin(Callback callback)
{
    _joinCallback = callback;
}

void LoRaWANClass::onReceive(void(*callback)(void))
{
    _receiveCallback = Callback(callback);
}

void LoRaWANClass::onReceive(Callback callback)
{
    _receiveCallback = callback;
}

void LoRaWANClass::onTransmit(void(*callback)(void))
{
    _transmitCallback = Callback(callback);
}

void LoRaWANClass::onTransmit(Callback callback)
{
    _transmitCallback = callback;
}

int LoRaWANClass::getDevEui(char *buffer, size_t size)
{
    uint8_t DevEui[8];
    unsigned int i;
    
    static const char xlate[17] = "0123456789abcdef";

    if (size < 17) {
        return 0;
    }

    BoardGetUniqueId(DevEui);

    for (i = 0; i < 8; i++)
    {
        *buffer++ = xlate[DevEui[i] >> 4];
        *buffer++ = xlate[DevEui[i] & 15];
    }

    *buffer++ = '\0';

    return 1;
}

int LoRaWANClass::getMaxPayloadSize()
{
    LoRaMacTxInfo_t txInfo;

    LoRaWANQueryTxPossible(0, &txInfo);

    return txInfo.CurrentPayloadSize;
}

unsigned int LoRaWANClass::getDataRate()
{
    if (!_Band) {
	return 0;
    }
	
    return _session.DataRate;
}

unsigned int LoRaWANClass::getTxPower()
{
    if (!_Band) {
	return 0;
    }

    return _Band->xlateTxPower[_session.TxPower];
}

unsigned long LoRaWANClass::getUpLinkCounter()
{
    return _session.UpLinkCounter;
}

unsigned long LoRaWANClass::getDownLinkCounter()
{
    return _session.DownLinkCounter;
}

int LoRaWANClass::setJoinDelay1(unsigned int delay)
{
    MibRequestConfirm_t mibReq;

    if (!_Band) {
        return 0;
    }

    if (_tx_busy) {
        return 0;
    }

    if (delay > 65535) {
        return 0;
    }

    mibReq.Type = MIB_JOIN_ACCEPT_DELAY_1;
    mibReq.Param.JoinAcceptDelay1 = delay;

    if (LoRaWANMibSetRequestConfirm(&mibReq) != LORAMAC_STATUS_OK) {
        return 0;
    }

    return 1;
}

int LoRaWANClass::setJoinDelay2(unsigned int delay)
{
    MibRequestConfirm_t mibReq;

    if (!_Band) {
        return 0;
    }

    if (_tx_busy) {
        return 0;
    }

    if (delay > 65535) {
        return 0;
    }

    mibReq.Type = MIB_JOIN_ACCEPT_DELAY_2;
    mibReq.Param.JoinAcceptDelay2 = delay;

    if (LoRaWANMibSetRequestConfirm(&mibReq) != LORAMAC_STATUS_OK) {
        return 0;
    }

    return 1;
}

int LoRaWANClass::setPublicNetwork(bool enable)
{
    MibRequestConfirm_t mibReq;

    if (!_Band) {
        return 0;
    }

    if (_tx_busy) {
        return 0;
    }
    
    mibReq.Type = MIB_PUBLIC_NETWORK;
    mibReq.Param.EnablePublicNetwork = enable;
    
    if (LoRaWANMibSetRequestConfirm(&mibReq) != LORAMAC_STATUS_OK){
        return 0;
    }

    _PublicNetwork = enable;

    return 1;
}

int LoRaWANClass::setADR(bool enable)
{
    MibRequestConfirm_t mibReq;

    if (!_Band) {
        return 0;
    }

    if (_tx_busy) {
        return 0;
    }
    
    mibReq.Type = MIB_ADR;
    mibReq.Param.AdrEnable = enable;
    
    if (LoRaWANMibSetRequestConfirm(&mibReq) != LORAMAC_STATUS_OK) {
        return 0;
    }

    if (!enable) {
        mibReq.Type = MIB_CHANNELS_DATARATE;
        mibReq.Param.ChannelsDatarate = _DataRate;
        LoRaWANMibSetRequestConfirm(&mibReq);

        mibReq.Type = MIB_CHANNELS_TX_POWER;
        mibReq.Param.ChannelsTxPower = _TxPower;
        LoRaWANMibSetRequestConfirm(&mibReq);
    }

    _AdrEnable = enable;

    return 1;
}

int LoRaWANClass::setDataRate(unsigned int datarate)
{
    MibRequestConfirm_t mibReq;

    if (!_Band) {
        return 0;
    }

    if (_tx_busy) {
        return 0;
    }

