GrumpyOldPizza/ArduinoCore-stm32l0/libraries/LoRaWAN/src/LoRaWAN.cpp
    mibReq.Type = MIB_CHANNELS_DEFAULT_DATARATE;
    mibReq.Param.ChannelsDefaultDatarate = datarate;
        
    if (LoRaWANMibSetRequestConfirm(&mibReq) != LORAMAC_STATUS_OK) {
        return 0;
    }

    if (!_AdrEnable || (_session.Joined == LORAWAN_JOINED_NONE))
    {
        mibReq.Type = MIB_CHANNELS_DATARATE;
        mibReq.Param.ChannelsDatarate = datarate;
        
        if (LoRaWANMibSetRequestConfirm(&mibReq) != LORAMAC_STATUS_OK) {
            return 0;
        }
    }

    _DataRate = datarate;

    return 1;
}

int LoRaWANClass::setTxPower(unsigned int power)
{
    unsigned int txPower;
    MibRequestConfirm_t mibReq;

    if (!_Band) {
        return 0;
    }

    if (_tx_busy) {
        return 0;
    }
    
    for (txPower = 10; txPower > 0; txPower--) {
        if (_Band->xlateTxPower[txPower] >= power) {
            break;
        }
    }

    mibReq.Type = MIB_CHANNELS_DEFAULT_TX_POWER;
    mibReq.Param.ChannelsDefaultTxPower = txPower;
    
    if (LoRaWANMibSetRequestConfirm(&mibReq) != LORAMAC_STATUS_OK) {
        return 0;
    }

    if (!_AdrEnable || (_session.Joined == LORAWAN_JOINED_NONE))
    {
        mibReq.Type = MIB_CHANNELS_TX_POWER;
        mibReq.Param.ChannelsTxPower = txPower;
        
        if (LoRaWANMibSetRequestConfirm(&mibReq) != LORAMAC_STATUS_OK) {
            return 0;
        }
    }

    _TxPower = txPower;

    return 1;
}

int LoRaWANClass::setRetries(unsigned int n)
{
    if (!_Band) {
        return 0;
    }

    if (n > 255) {
        return 0;
    }

    _Retries = n;

    return 1;
}

int LoRaWANClass::setRepeat(unsigned int n)
{
    MibRequestConfirm_t mibReq;

    if (!_Band) {
        return 0;
    }

    if (n > 15) {
        return 0;
    }

    mibReq.Type = MIB_CHANNELS_NB_REP;
    mibReq.Param.ChannelNbRep = n;
        
    if (LoRaWANMibSetRequestConfirm(&mibReq) != LORAMAC_STATUS_OK) {
	return 0;
    }
    
    _Repeat = n;

    return 1;
}

int LoRaWANClass::setReceiveDelay(unsigned int delay)
{
    MibRequestConfirm_t mibReq;

    if (!_Band) {
        return 0;
    }

    if (_tx_busy) {
        return 0;
    }

    if (delay > 65535) {
        return 0;
    }

    mibReq.Type = MIB_RECEIVE_DELAY_1;
    mibReq.Param.ReceiveDelay1 = delay;

    if (LoRaWANMibSetRequestConfirm(&mibReq) != LORAMAC_STATUS_OK) {
        return 0;
    }

    mibReq.Type = MIB_RECEIVE_DELAY_2;
    mibReq.Param.ReceiveDelay2 = delay + 1000;

    if (LoRaWANMibSetRequestConfirm(&mibReq) != LORAMAC_STATUS_OK) {
        return 0;
    }

    return 1;
}

int LoRaWANClass::setRX2Channel(unsigned long frequency, unsigned int datarate)
{
    MibRequestConfirm_t mibReq;

    if (!_Band) {
        return 0;
    }

    if (_tx_busy) {
        return 0;
    }

    mibReq.Type = MIB_RX2_CHANNEL;
    mibReq.Param.Rx2Channel.Frequency = frequency;
    mibReq.Param.Rx2Channel.Datarate = datarate;
    
    if (LoRaWANMibSetRequestConfirm(&mibReq) != LORAMAC_STATUS_OK) {
        return 0;
    }
    
    return 1;
}

int LoRaWANClass::setSubBand(unsigned int subband)
{
    uint16_t ChannelsMask[(LORA_MAX_NB_CHANNELS +15) / 16];
    unsigned int group;
    MibRequestConfirm_t mibReq;
    
    if (!_Band) {
        return 0;
    }

    if (_tx_busy) {
        return 0;
    }

    if (!((_Band->id == REGION_AU915) || (_Band->id == REGION_US915))) {
        return 0;
    }

    if (subband > 8) {
        return 0;
    }

    memset(&ChannelsMask[0], 0, sizeof(ChannelsMask));

    if (subband > 0)
    {
        group = subband -1;

        ChannelsMask[group >> 1] = ((group & 1) ? 0xFF00 : 0x00FF);
        ChannelsMask[4] = (0x0001 << group);
    }
    else
    {
        ChannelsMask[0] = 0xFFFF;
        ChannelsMask[1] = 0xFFFF;
        ChannelsMask[2] = 0xFFFF;
        ChannelsMask[3] = 0xFFFF;
        ChannelsMask[4] = 0x00FF;
    }

    mibReq.Type = MIB_CHANNELS_DEFAULT_MASK;
    mibReq.Param.ChannelsDefaultMask = ChannelsMask;

    if (LoRaWANMibSetRequestConfirm(&mibReq) != LORAMAC_STATUS_OK) {
        return 0;
    }

    if (_session.Joined == LORAWAN_JOINED_NONE) {
	mibReq.Type = MIB_CHANNELS_MASK;
	mibReq.Param.ChannelsMask = ChannelsMask;

	if (LoRaWANMibSetRequestConfirm(&mibReq) != LORAMAC_STATUS_OK) {
	    return 0;
	}
    }

    return 1;
}

int LoRaWANClass::addChannel(unsigned int index, unsigned long frequency, unsigned int drMin, unsigned int drMax)
{
    ChannelParams_t params;

    if (!_Band) {
        return 0;
    }

    if ((_Band->id == REGION_AU915) || (_Band->id == REGION_US915)) {
        return 0;
    }

    // AS923: index == 0..15
    // EU868: index == 0..15
    // IN868: index == 0..15
    // KR920: index == 0..15

    if (index > 15) {
        return 0;
    }

    if (_tx_busy) {
        return 0;
    }

    params.Frequency = frequency;
    params.Rx1Frequency = 0;
    params.DrRange.Fields.Min = drMin;
    params.DrRange.Fields.Max = drMax;
    params.Band = 0;

    if (LoRaWANChannelAdd(index, &params) != LORAMAC_STATUS_OK) {
        return 0;
    }

    return 1;
}

int LoRaWANClass::removeChannel(unsigned int index)
{
    if (!_Band) {
        return 0;
    }

    if ((_Band->id == REGION_AU915) || (_Band->id == REGION_US915)) {
        return 0;
    }

    // AS923: index == 0..15
    // EU868: index == 0..15
    // IN868: index == 0..15
    // KR920: index == 0..15

    if (index > 15) {
        return 0;
    }

    if (_tx_busy) {
        return 0;
    }

    if (LoRaWANChannelRemove(index) != LORAMAC_STATUS_OK) {
        return 0;
    }

    return 1;
}

int LoRaWANClass::enableChannel(unsigned int index)
{
    uint16_t ChannelsMask[(LORA_MAX_NB_CHANNELS + 15) / 16];
    MibRequestConfirm_t mibReq;

    if (!_Band) {
        return 0;
    }

    if (_tx_busy) {
        return 0;
    }

    // AS923: index == 0..15
    // AU915: index == 0..71
    // EU868: index == 0..15
    // IN868: index == 0..15
    // KR920: index == 0..15
    // US915: index == 0..71

    if ((_Band->id == REGION_AU915) || (_Band->id == REGION_US915)) {
        if (index > 71) {
            return 0;
        }
    } else {
        if (index > 15) {
            return 0;
        }
    }

