GrumpyOldPizza/ArduinoCore-stm32l0/libraries/LoRaWAN/src/LoRaWAN.cpp
    mibReq.Type = MIB_CHANNELS_MASK;

    if (LoRaWANMibGetRequestConfirm(&mibReq) != LORAMAC_STATUS_OK) {
        return 0;
    }
    
    memcpy(&ChannelsMask[0], mibReq.Param.ChannelsMask, sizeof(ChannelsMask));

    ChannelsMask[index >> 4] |= (1u << (index & 15));

    mibReq.Type = MIB_CHANNELS_MASK;
    mibReq.Param.ChannelsMask = ChannelsMask;

    if (LoRaWANMibSetRequestConfirm(&mibReq) != LORAMAC_STATUS_OK) {
        return 0;
    }

    return 1;
}

int LoRaWANClass::disableChannel(unsigned int index)
{
    uint16_t ChannelsMask[(LORA_MAX_NB_CHANNELS +15) / 16];
    MibRequestConfirm_t mibReq;

    if (!_Band) {
        return 0;
    }

    if (_tx_busy) {
        return 0;
    }

    // AS923: index == 0..15
    // AU915: index == 0..71
    // EU868: index == 0..15
    // IN868: index == 0..15
    // KR920: index == 0..15
    // US915: index == 0..71

    if ((_Band->id == REGION_AU915) || (_Band->id == REGION_US915)) {
        if (index > 71) {
            return 0;
        }
    } else {
        if (index > 15) {
            return 0;
        }
    }

    mibReq.Type = MIB_CHANNELS_MASK;

    if (LoRaWANMibGetRequestConfirm(&mibReq) != LORAMAC_STATUS_OK) {
        return 0;
    }
    
    memcpy(&ChannelsMask[0], mibReq.Param.ChannelsMask, sizeof(ChannelsMask));

    ChannelsMask[index >> 4] &= ~(1u << (index & 15));

    mibReq.Type = MIB_CHANNELS_MASK;
    mibReq.Param.ChannelsMask = ChannelsMask;

    if (LoRaWANMibSetRequestConfirm(&mibReq) != LORAMAC_STATUS_OK) {
        return 0;
    }

    return 1;
}

int LoRaWANClass::setAntennaGain(float gain)
{
    MibRequestConfirm_t mibReq;

    if (!_Band) {
        return 0;
    }

    if (_tx_busy) {
        return 0;
    }

    mibReq.Type = MIB_ANTENNA_GAIN;
    mibReq.Param.AntennaGain = gain;

    if (LoRaWANMibSetRequestConfirm(&mibReq) != LORAMAC_STATUS_OK) {
        return 0;
    }

    return 1;
}

int LoRaWANClass::setDutyCycle(bool enable)
{
    if (!_Band) {
        return 0;
    }

    if (_tx_busy) {
        return 0;
    }

    if (!((_Band->id == REGION_EU868) || (_Band->id == REGION_IN865))) {
        return 0;
    }

    LoRaMacTestSetDutyCycleOn(enable);

    return 1;
}

void LoRaWANClass::__McpsResend()
{
    McpsReq_t mcpsReq;

    LoRaWAN._tx_active = false;

    if (LoRaWAN._tx_confirm)
    {
        mcpsReq.Type = MCPS_CONFIRMED;
        mcpsReq.Req.Confirmed.fPort = LoRaWAN._tx_port;
        mcpsReq.Req.Confirmed.fBuffer = &LoRaWAN._tx_data[0];
        mcpsReq.Req.Confirmed.fBufferSize = LoRaWAN._tx_size;
        mcpsReq.Req.Confirmed.NbTrials = 1 + LoRaWAN._Retries;
        mcpsReq.Req.Confirmed.Datarate = LoRaWAN._DataRate;
    }
    else
    {
        mcpsReq.Type = MCPS_UNCONFIRMED;
        mcpsReq.Req.Unconfirmed.fPort = LoRaWAN._tx_port;
        mcpsReq.Req.Unconfirmed.fBuffer = &LoRaWAN._tx_data[0];
        mcpsReq.Req.Unconfirmed.fBufferSize = LoRaWAN._tx_size;
        mcpsReq.Req.Unconfirmed.Datarate = LoRaWAN._DataRate;
    }

    if (LoRaMacMcpsRequest(&mcpsReq) != LORAMAC_STATUS_OK) {
        LoRaWAN._tx_busy = false;
    }
}

void LoRaWANClass::__McpsConfirm( McpsConfirm_t *mcpsConfirm )
{
    MibRequestConfirm_t mibReq;

    if (mcpsConfirm->Status != LORAMAC_EVENT_INFO_STATUS_OK) {
        return;
    }

    LoRaWAN._session.DataRate = mcpsConfirm->Datarate;
    LoRaWAN._session.TxPower = mcpsConfirm->TxPower;
    LoRaWAN._session.UpLinkCounter = mcpsConfirm->UpLinkCounter;

    switch (mcpsConfirm->McpsRequest) {
    case MCPS_UNCONFIRMED:
        if (LoRaWAN._tx_active)
        {
            armv6m_pendsv_enqueue((armv6m_pendsv_routine_t)LoRaWANClass::__McpsResend, NULL, 0);
        }
        else
        {
            LoRaWAN._tx_busy = false;
        }
        break;

    case MCPS_CONFIRMED:
        LoRaWAN._tx_ack = mcpsConfirm->AckReceived ? mcpsConfirm->NbRetries : 0;
        LoRaWAN._tx_busy = false;
        break;

    case MCPS_PROPRIETARY:
        break;

    default:
        break;
    }

    if (!LoRaWAN._tx_busy)
    {
        // late LoRaWAN::stop()
        if (LoRaWAN._session.Joined == LORAWAN_JOINED_NONE)
        {
            mibReq.Type = MIB_NETWORK_JOINED;
            mibReq.Param.IsNetworkJoined = true;
            LoRaMacMibSetRequestConfirm(&mibReq);
        }

        LoRaWAN._transmitCallback.queue();
    }
}

void LoRaWANClass::__McpsIndication( McpsIndication_t *mcpsIndication )
{
    uint32_t rx_write, rx_size;

    if (mcpsIndication->Status != LORAMAC_EVENT_INFO_STATUS_OK) {
        return;
    }

    switch (mcpsIndication->McpsIndication) {
    case MCPS_UNCONFIRMED:
        break;

    case MCPS_CONFIRMED:
        break;

    case MCPS_PROPRIETARY:
        break;

    case MCPS_MULTICAST:
        break;

    default:
        break;
    }

    LoRaWAN._session.DownLinkCounter = mcpsIndication->DownLinkCounter;

    LoRaWAN._rx_snr = mcpsIndication->Snr;
    LoRaWAN._rx_rssi = mcpsIndication->Rssi;

    if (mcpsIndication->RxData == true)
    {
        rx_write = LoRaWAN._rx_write;

        if (rx_write < LoRaWAN._rx_read) {
            rx_size = LoRaWAN._rx_read - rx_write -1;
        } else {
            rx_size = (LORAWAN_RX_BUFFER_SIZE - rx_write) + LoRaWAN._rx_read -1;
        }

        if (rx_size >= (unsigned int)(3 + mcpsIndication->BufferSize))
        {
            LoRaWAN._rx_data[rx_write] = mcpsIndication->BufferSize;
            
            if (++rx_write == LORAWAN_RX_BUFFER_SIZE) {
                rx_write = 0;
            }

            LoRaWAN._rx_data[rx_write] = mcpsIndication->Port;

            if (++rx_write == LORAWAN_RX_BUFFER_SIZE) {
                rx_write = 0;
            }

            LoRaWAN._rx_data[rx_write] = mcpsIndication->Multicast;

            if (++rx_write == LORAWAN_RX_BUFFER_SIZE) {
                rx_write = 0;
            }

            rx_size = mcpsIndication->BufferSize;

            if (rx_size > (LORAWAN_RX_BUFFER_SIZE - rx_write)) {
                rx_size = LORAWAN_RX_BUFFER_SIZE - rx_write;
            }

            if (rx_size) {
                memcpy(&LoRaWAN._rx_data[rx_write], mcpsIndication->Buffer, rx_size);

                rx_write += rx_size;

                if (rx_write >= LORAWAN_RX_BUFFER_SIZE) {
                    rx_write -= LORAWAN_RX_BUFFER_SIZE;
                }
            }

