GrumpyOldPizza/ArduinoCore-stm32l0/libraries/LoRaWAN/src/LoRaWAN.cpp
            if (rx_size != mcpsIndication->BufferSize) {
                memcpy(&LoRaWAN._rx_data[rx_write], mcpsIndication->Buffer + rx_size, mcpsIndication->BufferSize - rx_size);

                rx_write += (mcpsIndication->BufferSize - rx_size);
            }

            LoRaWAN._rx_write = rx_write;
        }
    }

    LoRaWAN._receiveCallback.queue();
}

void LoRaWANClass::__MlmeConfirm( MlmeConfirm_t *mlmeConfirm )
{
    MibRequestConfirm_t mibReq;

    switch (mlmeConfirm->MlmeRequest) {
    case MLME_JOIN:
        if (mlmeConfirm->Status == LORAMAC_EVENT_INFO_STATUS_OK)
        {
            mibReq.Type = MIB_DEV_ADDR;
            LoRaMacMibGetRequestConfirm(&mibReq);
            LoRaWAN._session.DevAddr = mibReq.Param.DevAddr;

            mibReq.Type = MIB_NWK_SKEY;
            LoRaMacMibGetRequestConfirm(&mibReq);
            memcpy(LoRaWAN._session.NwkSKey, mibReq.Param.NwkSKey, 16);

            mibReq.Type = MIB_APP_SKEY;
            LoRaMacMibGetRequestConfirm(&mibReq);
            memcpy(LoRaWAN._session.AppSKey, mibReq.Param.AppSKey, 16);

            LoRaWAN._session.Joined = LORAWAN_JOINED_OTAA;

            LoRaWAN._tx_busy = false;
        }
        else
        {
            LoRaWAN._tx_busy = false;
        }

        LoRaWAN._joinCallback.queue();
        break;

    case MLME_LINK_CHECK:
        if (mlmeConfirm->Status == LORAMAC_EVENT_INFO_STATUS_OK)
        {
            LoRaWAN._rx_margin = mlmeConfirm->DemodMargin;
            LoRaWAN._rx_gateways = mlmeConfirm->NbGateways;
            LoRaWAN._rx_ack = true;
        }
        break;

    default:
        break;
    }
}

void LoRaWANClass::__MlmeIndication( MlmeIndication_t *mlmeIndication )
{
    (void)mlmeIndication;
}

LoRaWANClass LoRaWAN;
